eNum_1_0_1_1/DataProcessors/ун30_ПанельУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ун30_ПанельУправления</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДокументыНумерации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантНумерации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

eNum_1_0_1_1/DataProcessors/ун30_ПанельУправления/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьДокументыНумерации();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыНумерации(Команда)
	ИнициализироватьДокументыНумерации();
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДокументыНумерации()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИнициализироватьДокументыНумерации();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНумерацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Строка = Объект.ДокументыНумерации[ВыбраннаяСтрока];
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("ИмяДокумента", Строка.ИмяДокумента);
	ДопПараметры.Вставить("ПредставлениеДокумента", Строка.ПредставлениеДокумента);
	
	//Оповещение = Новый ОписаниеОповещения("ОткрытьФормуНастроекНумерацииДокумента", ЭтотОбъект, ДопПараметры);
	//ПоказатьВопрос(Оповещение, "Настройка нумерации документа ?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет);
	
	ОткрытьФорму("ВнешняяОбработка.ун30_ПанельУправления.Форма.ФормаНастроекДокумента", ДопПараметры, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроекНумерацииДокумента(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ВнешняяОбработка.ун30_ПанельУправления.Форма.ФормаНастроекДокумента", 
	ДопПараметры, 
	ЭтотОбъект,,,,, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
